tutorials/acoustic/monopole1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application          rhoCentralFoam;

startFrom            latestTime;

startTime            0;

stopAt               endTime;

endTime              0.1;

deltaT               2.5e-6;

writeControl         adjustableRunTime;

writeInterval        5e-3;

purgeWrite           200;

writeFormat          ascii;

writePrecision       9;

writeCompression     on;

timeFormat           general;

timePrecision        6;

runTimeModifiable    true;

adjustTimeStep       false;

maxCo                0.5;

maxDeltaT            1e-5;

CourantType          cellCourant;

functions
{
    #include "probeControl"
    #include "sphereAverage"
    #include "fwhControl"
}

// ************************************************************************* //
