tutorials/acoustic/monopole1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    free
    {
        type            waveTransmissive;
        field           U;
        phi             phi;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        value           uniform (0 0 0);
    }

    sphere
    {
        type            zeroGradient;
    }

    #include "cyc"
}

// ************************************************************************* //
