tutorials/acoustic/monopole1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    sphere
    {
        type             uniformFixedValue;
        uniformValue     sine;
        uniformValueCoeffs
        {
            frequency    100;
            amplitude    1000;
            scale        1;
            level        101325;
            t0           0;
        }
    }

    free
    {
        type             waveTransmissive;
        field            p;
        psi              thermo:psi;
        rho              rho;
        phi              phi;
        gamma            1.4;
        value            uniform 101325;
    }

    #include "cyc"

}

// ************************************************************************* //



