tutorials/acoustic/monopole1D/0/cyc
    "(cyc1|cyc2|cyc3|cyc4)"
    {
        type            wedge;
    }

