tutorials/acoustic/monopole1D/system/fwhControl
monopoleFwhTest
{
    #include                    "commonSettings";
    type                        FfowcsWilliamsHawkings;
    patches                     ("sphere");
    interpolationScheme         cell;
    formulationType             Farassat1AFormulation;
    U0                          (0.0 0.0 0.0);
    cleanFreq                   100;

    surfaces
    (
        sphere
        {
            type                patch;
            patches             ("sphere");
            interpolate         false;
        }
    );

    nonUniformSurfaceMotion     false;
    Ufwh                        (0.0 0.0 0.0);
}
